Revit 2024 API
FormulaEditingEventArgs.Apply Method
 Applies formula to the parameter
Namespace: Autodesk.Revit.UI.Events
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public void Apply(
	string formula
)
Visual Basic
Public Sub Apply ( _
	formula As String _
)
Visual C++
public:
void Apply(
	String^ formula
)
Parameters
formula
Type: System.String
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
FormulaEditingEventArgs Class
Autodesk.Revit.UI.Events Namespace